import 'package:flutter/material.dart';
import 'package:kau_app/utils/app_theme.dart';

class PrivacyPage extends StatefulWidget {
  @override
  _PrivacyPage createState() => _PrivacyPage();
}

class _PrivacyPage extends State<PrivacyPage> {
  @override
  Widget build(BuildContext context) {
    return Directionality(
      textDirection: TextDirection.rtl,
      child: Scaffold(
        backgroundColor: myBackground,
        appBar: AppBar(
          elevation: 0.0,
          backgroundColor: myBackground,
          iconTheme: IconThemeData(
            color: myBink, //change your color here
          ),
        ),
        body: SafeArea(
          child: Container(
            color: myBackground,
            child: SingleChildScrollView(
              child: Padding(
                padding: const EdgeInsets.all(12.0),
                child: Center(
                  child: Column(
                    children: <Widget>[
                      SizedBox(
                        height: 20,
                      ),
                      Image(
                        image: AssetImage('assets/loglo.png'),
                        width: MediaQuery.of(context).size.width / 1.7,
                      ),
                      Text(
                        'سياسة الخصوصية',
                        style: TextStyle(
                            fontFamily: fontHiding1,
                            color: myBlue,
                            fontSize: 36),
                      ),
                      SizedBox(
                        height: 30,
                      ),
                      Text(
                        """تمهيد

تطبيق الابن الرضي هو منصة إلكترونية تفاعلية، تقوم بتقديم العديد من الخدمات لتفاعل الوالدين مع أبنائهم بين كافة المستخدمين من خلال تطبيقها الإلكتروني (appname.app)، وقد يشار إليها بـ (الابن الرضي، نحن، لنا، لدينا) ويشار لمستخدميها بـ (المستخدم، الزائر، الابن، الوالدين، أنت)، كما أنها تقوم بجمع بيانات الزوار/ المستخدمين المقدمة من قبلهم سواء من خلال تصفحهم للتطبيق أو استخدامهم له. إضافةً إلى أن سياسة الخصوصية للابن الرضي، هي بمثابة وثيقة إلكترونية ملزمه قانونيًا لكل من: (المنصة، الوالدين) وبمجرد الاطلاع عليها ومتابعة استخدام منصتها الإلكترونية فإنك تقر بموافقتك والتزامك بها.

كيفية الوصول للبيانات، ونوعيتها

يتم جمع البيانات من قبل الزوار/المستخدمين، من خلال: 

1.      التصفح، عنوان بروتوكول شبكة الإنترنت (IP): 

إذ تعمل الخوادم المشغلة للتطبيق الإلكتروني الابن الرضي -وكافة المواقع الأخرى- تلقائيًا من خلال السيرفر المستضيف بتسجيل عنوان بروتوكول شبكة الإنترنت (IP) الخاص بالزائر/المستخدم، من موقع جغرافي وتاريخ ووقت الزيارة ونوعية متصفح الإنترنت المستخدم وعنوان URL الخاص به. 

واستخدامنا للـ (IP) الخاص بك يساعدنا على تشخيص المشكلات التي تحدث في السيرفرات الخاصة بنا، إجراء الإحصاء اللازم لقياس استخدام التطبيق (عدد الزوار ولغة جهاز الكمبيوتر الذي تستخدمه)، كما إننا لا نسمح لأي جهة خارج إطار الفريق الفني لتطبيق الابن الرضي بالاطلاع على بروتوكول الإنترنت الخاص بك.

2.               البيانات الشخصية، المقدمة من قبل المستخدم: 

إذ نحصل على بياناتك الشخصية المقدمة من قبلك كمستخدم، مثل: الاسم، تاريخ الميلاد، الجنس، البريد الإلكتروني، تفاصيل البطاقة الائتمانية في حال الرغبة في الاشتراك من خلال منصتنا.

إضافةً إلى أنه هنالك حد أدنى لعمر المستخدم (المشرف)، إذ يجب ألا يقل عن 18 سنة، بحسب الأنظمة والقوانين في المملكة العربية السعودية لا يمكننا التعاقد معه مباشرة، إلا في حال إقرار ولي الأمر وموافقته على ذلك نيابة عنه.

أما إذا كان المستخدم طفل فيجب ألا يقل عن ٥ سنوات ولا يزيد عن ٧ سنوات.

استخدام البيانات، ومشاركتها

لن يتم بيع، متاجرة، تأجير أي من بياناتك الخاصة دون إذن مسبق، إلا أننا قد نتشاركها مع عدد من الجهات المعنية، وهي: 

1.      مزودي الخدمات: هم من يساهمون في تسهيل تقديم بعض خدماتنا مثل: خدمات الدفع الإلكتروني، سواء كانوا متواجدين داخل المملكة العربية السعودية أو خارجها.

2.     الشركات التقنية: وهي تقوم بإدارة وتحليل البيانات المتوفرة، من خلال منصتنا الإلكترونية ومواقع التواصل الاجتماعي وغيرها، فتعمل مثلاً على: تحليل اراء العملاء وسلوكياتهم، وتحديد اتجاهاتهم مما يجعل من عملية التسويق على سبيل المثال، أكثر فعالية. 

مع مراعاة كافة الجهات السابقة لخصوصية بيانات المستخدمين، والتزامهم بالحفاظ عليها واستخدامها وفقًا لتعليماتنا وسياسة الخصوصية لدينا.

3.     السلطات القضائية والتنظيمية: نملك الحق في الإفصاح عن أي من بياناتك الشخصية في حال صدور أمر قضائي/ تنظيمي من قبل السلطات الممثلة للأنظمة والقوانين في المملكة العربية السعودية، وبعض الدول التي نعمل من خلالها. 

 

مدة حفظ وتخزين البيانات، وكيفية ذلك

يتم تخزين البيانات وحفظها ومعالجتها في خوادم آمنة داخل المملكة العربية السعودية أو خارجها، بهدف تحسين تجربة المستخدم، ويكتفى بالبيانات التي يمكن من خلالها تلبية المتطلبات الضرورية مثل: القانونية، المحاسبية وغيرها. ومدة الحفظ تنتهي بإنهاء/ إلغاء المستخدم لحسابة الشخصي لدينا، كما أنه بعض البيانات لا يتم حفظها مثل: بيانات الدفع لحساسيتها.

إضافةً إلى قيامنا بأخذ كافة التدابير الاحترازية الممكنة لحماية بياناتك الشخصية من الفقد المفاجئ، الاستخدام الغير قانوني، من خلال تقليل المخاطر الأمنية وتحديدها ومحاولة معالجتها وإصلاحها، إضافةً لحصولنا على شهادة SSL وهي عبارة عن بروتوكول يساهم بشكل كبير في تأمين وتشفير بيانات المستخدم خلال تنقله عبر التطبيق، والتي قد تتضمن معلومات حساسة، مثل: بيانات تسجيل الدخول والدفع وغيرها. 

إلا أن ذلك لا يعني عدم إمكانية الوصول لها مطلقًا، حيث أن الإنترنت والشبكات المفتوحة لا تعد آمنة على الإطلاق. 

حقوقك كمستخدم، على بياناتك

بلا شك تملك الحق كمستخدم لتطبيق الابن الرضي في الوصول لبياناتك الشخصية المحفوظة لدينا، لتتحقق من كيفية معالجتنا لها، كما لك الحق في طلب تحديث، حذف، تصحيح أي من بياناتك متى رأيت الحاجة لذلك، إضافة لحقك في الاعتراض على كيفية معالجة بياناتك إلا أن ذلك لابد أن يكون مبينًا على أساس قانوني/مشروع، وننوه على أن ذلك لن يؤثر بالمطلق على أي معالجات قانونية سبق أن قمنا بها بناء على موافقتكم السابقة.

ولتزويدك بنسخة من البيانات فإن ذلك قد يتطلب منك الانتظار لمدة قد تصل لشهر، أو أكثر بحسب تعقيد كل طلب بشكل خاص، كما قد يكلفك ذلك مبلغًا رمزيًا، لتكلفة توفيرها، وقد يرفض طلبك في بعض الأحوال مثل: تكرار طلباتك بشكل متكرر ومفرط دون مبرر. 

Cookies، ملفات تعريف الارتباط

هي عبارة عن ملفات نصية تخزن بشكل تلقائي لدى جهاز الزائر/ المستخدم عند زيارته للموقع أو التطبيق، نتمكن من خلالها معرفة التفضيلات الخاصة بكل زائر/ مستخدم، وبذلك تُسهل عملية تصفحه للمنصة وتظهر له الإعلانات ذات الصلة باهتماماته، فاستخدامنا لها يهدف بشكل رئيسي لتحسين تجربتك كمستخدم من خلال معرفة سلوكه وتفاعلاته مع المنصة ومحتوياتها.

 كما إنه بالإمكان ضبط المتصفح الخاص بالزائر/ المستخدم لتنبيهه عند زيارة المواقع المستخدمة لملفات تعريف الارتباط، وفي حال تعطيل/ رفض استخدامنا لملفات تعريف الارتباط، فإن ذلك سيؤثر على استخدام الزائر/ المستخدم لبعض من خدمات منصتنا أو قد لا تعمل معه بشكل الصحيح.

الروابط والإعلانات

في حال دخولك إلى أي من الروابط أو الإعلانات، المتاحة في منصتنا فإنه يتوجب عليك حينها الاطلاع وقراءة سياسة الخصوصية لديها، فإننا لا نضمن بأي حال من الأحوال سياسة الخصوصية لديهم، ونخلي مسؤوليتنا تمامًا عن أي ممارسات قد تقع على بياناتك الشخصية من قبلهم.

المرجعية القضائية

الشريعة الإسلامية، والأنظمة والقوانين المعمول بها في المملكة العربية السعودية، هي أساس كافة التعاملات والمطالبات التي قد تنشأ عن استخدام تطبيق الابن الرضي.

التعديلات على سياسة الخصوصية

تحتفظ منصة الابن الرضي الإلكترونية بحق تعديل أي من بنود سياسة الخصوصية الخاصة بها، وعليه فإنه يقع على عاتقك كمستخدم مراجعة هذه الصفحة بشكل دوري لتحقق من وجود أي تعديل.

للتواصل

في حال رغبتك في التواصل، تقديم الاقتراحات، أو الشكاوى فإنه يمكنك ذلك من خلال زيارة صفحة (صفحة تواصل معنا).

 

 
                        """,
                        style: TextStyle(
                            fontFamily: fontHiding2,
                            color: Colors.grey[800],
                            fontSize: 20),
                      ),
                    ],
                  ),
                ),
              ),
            ),
          ),
        ),
      ),
    );
  }
}
