import 'package:flutter/material.dart';
import 'package:kau_app/utils/app_theme.dart';

class ConditionsPage extends StatefulWidget {
  @override
  _ConditionsPage createState() => _ConditionsPage();
}

class _ConditionsPage extends State<ConditionsPage> {
  @override
  Widget build(BuildContext context) {
    return Directionality(
      textDirection: TextDirection.rtl,
      child: Scaffold(
        backgroundColor: myBackground,
        appBar: AppBar(
          elevation: 0.0,
          backgroundColor: myBackground,
          iconTheme: IconThemeData(
            color: myBink, //change your color here
          ),
        ),
        body: SafeArea(
          child: Container(
            color: myBackground,
            child: SingleChildScrollView(
              child: Padding(
                padding: const EdgeInsets.all(12.0),
                child: Center(
                  child: Column(
                    children: <Widget>[
                      SizedBox(
                        height: 20,
                      ),
                      Image(
                        image: AssetImage('assets/loglo.png'),
                        width: MediaQuery.of(context).size.width / 1.7,
                      ),
                      Text(
                        'الشروط والأحكام',
                        style: TextStyle(
                            fontFamily: fontHiding1,
                            color: myBlue,
                            fontSize: 36),
                      ),
                      SizedBox(
                        height: 30,
                      ),
                      Text(
                        """
تمهيد

يعمل تطبيق الابن الرضي على ربط الوالدين بأبنائهم والتفاعل معهم، من خلال التطبيق الإلكتروني (appname.app) موفر من خلاله منصة إلكترونية تفاعلية لعرض المهام اليومية، تقديم المكافئات، ومتابعة الأبناء. كما يقدم الابن الرضي خدماته وفقًا للشروط والأحكام الخاصة به، والتي تعد بمثابة عقد إلكتروني ملزم لكافة الأطراف (المنصة، الوالدين)، وباستمرارك بالتصفح والاستفادة من خدماته فإنك تقر على التزامك وموافقتك عليها، مع احتفاظ تطبيق الابن الرضي بالحق في تعديل، وتغير شروطه وفق لتقديره المطلق، لذلك يرجى مراجعة هذه الصفحة بشكل دوري لتحقق من وجود أي تعديل، وفي حال عدم موافقتك على التعديلات فإن خيارك الوحيد هو التوقف مباشرة عن استخدام التطبيق.

الخدمات المقدمة من منصة الابن الرضي

المشرف (الوالدين):

·        تمكين المستخدم من التسجيل في التطبيق وإضافة أبنائه وإعلامهم بذلك.

·        تمكين المستخدم من إضافة أو تعديل أو حذف فرد من أفراده، مع إمكانية إضافة مشرف ثاني.

·        تمكين المستخدم من إضافة وحذف وتعديل مذكرة مع إمكانية الإطلاع على مذكرات الآخرين.

·        تمكين المستخدم من إضافة أو حذف أو تعديل مهام وإرسالها للأبناء والاطلاع على إنجازهم.

·        تمكين المستخدم من إضافة أو حذف أو تعديل مكافئات وإرسالها للأبناء،

·        تمكين المستخدم من الإطلاع على أفراد العائلة وإنجازاتهم وترتيبهم بحسب النقاط والمهام المنجزة.

·        تمكين المستخدم من عمل تسجيل دخول لأبنائه عن طريق تطبيق الطفل.

التزامات المستخدم

·        يلتزم المستخدم بما يتم نشره من محتوى عبر منصة الابن الرضي الإلكترونية، على سبيل المثال لا الحصر: صور، فيديوهات، تعليقات وغيرها، بأن تكون متوافقة كليًا مع شروط هذه الاتفاقية.

·        للمنصة الحق المطلق في إيقاف، تقييد أي من مستخدميها من الاستفادة من الخدمات التي تقدمها، على سبيل المثال لا الحصر عند: مخالفة الشروط والأحكام الخاصة بها من نشر محتوى غير لائق، مخالف للأنظمة والقوانين وغيرها. 

·        لابد من توافر الأهلية والقدرة لديك كمستخدم لاستخدام الخدمات التي تقدمها منصة الابن الرضي إذ أن المنصة مخصصة للبالغين، وفي حين أن عمرك لم يتجاوز (18 عام) فلا بد من الحصول على الموافقة من قبل ولي أمرك، الوصي، الممثل القانوني، وإتمامهم للعمليات نيابة عنك.

·        تخضع كافة التعاملات التي قد تنشأ عن استخدام منصة الابن الرضي، بشكل كامل وحصري لأحكام الشريعة الإسلامية والأنظمة والقوانين المعمول بها في المملكة العربية السعودية، ولا يعتد بأي نظام قضائي آخر.

·        يلتزم المستخدم بكيفية استخدام المنصة الإلكترونية واستعراض الروابط والإعلانات التي قد تظهر له، وكيفية التعاطي معها، مع وضع في عين الاعتبار كافة المخاطر المحتملة التي قد تقع سواء محتوى غير لائق أو مضلل أو مخترق لخصوصيته. 

·        يلتزم المستخدم بعدم انتهاك حقوق الملكية الفكرية لمنصة الابن الرضي الإلكترونية على سبيل المثال لا الحصر: العلامة التجارية، تعديل، استنساخ، إعادة توزيع أو انتاج للتطبيق، إعادة إنتاج للمواد، أو السماح للآخرين بالقيام بالأعمال المحظورة، كما إنك تقر على ملكية الابن الرضي لـ: علامته التجارية، الصور، والكتابات والميزات التفاعلية، الشعارات الخاصة به وغيرها، كما لا يجوز لك بكافة الأحوال محاولة فك شفرات الخدمات، تفكيك الهندسة العكسية لها، وعليه فإنك توافق على عدم انتهاك -دون تقييد- أي من حقوق الملكية الفكرية وحقوق الطبع والنشر الخاصة بالابن الرضي أو بالمنصات الأخرى المتعاقدة مع الابن الرضي  والتي تخضع بشكل حصري للأنظمة والقوانين المعمول بها في المملكة العربية السعودية.

حدود المسئولية

لا يقع على عاتق الابن الرضي وكافة منسوبيها من (مسؤولين، إداريين، موظفين الدعم الفني وغيرهم) والشركات تابعة لها، أدنى مسؤولية تجاه: 

·        المحتوى المنشور من قبل المستخدمين، الناتج عن سوء استخدام ومخالفة لشروط واحكام المنصة، إذ لا يتم فحص وتدقيق -بشكل يومي- كافة المنشورات من قبل الابن الرضي، مع احتفاظ الابن الرضي في حق حذف أي منشور مخالف، وتقييد أو إيقاف المستخدم الناشر لها، إضافة إلى تمكن المستخدمين من التبليغ عن أي محتوى منشور قد يرونه مخالف.

·        الإعلانات الروابط الموجودة على المنصة، إذ لا يقع على عاتق الابن الرضي أدنى مسؤولية عما قد يظهر أو تتعرض له نتيجة استعراضك لهذه الروابط من محتوى مضلل، ضار، غير لائق.

 

سياسة الإلغاء والاسترجاع

·        .....

·        ....

إيقاف، تقييد الاستخدام

لمنصة الابن الرضي الحق المطلق في إيقاف، تقييد أي من مستخدميها من الاستفادة من الخدمات التي تقدمها، على سبيل المثال لا الحصر عند: مخالفة الشروط والاحكام الخاصة بها من نشر محتوى غير لائق، مخالف لأنظمة والقوانين وغيرها. 

الأحكام العامة

·        لابد من توافر الأهلية والقدرة لديك كمستخدم لاستخدام الخدمات التي تقدمها منصة الابن الرضي إذ أن المنصة مخصصة للبالغين، وفي حين أن عمرك لم يتجاوز (18 عام) فلا بد من الحصول على الموافقة من قبل ولي أمرك، الوصي، الممثل القانوني، وإتمامهم للعمليات نيابة عنك.

·        تخضع كافة التعاملات التي قد تنشأ عن استخدام منصة الابن الرضي، بشكل كامل وحصري لأحكام الشريعة الإسلامية والأنظمة والقوانين المعمول بها في المملكة العربية السعودية، ولا يعتد بأي نظام قضائي آخر.

للتواصل

·        في حال رغبتك في التواصل، تقديم الاقتراحات، أو الشكاوى فإنه يمكنك ذلك من خلال زيارة صفحة (صفحة تواصل معنا).


                        """,
                        style: TextStyle(
                            fontFamily: fontHiding2,
                            color: Colors.grey[800],
                            fontSize: 20),
                      ),
                    ],
                  ),
                ),
              ),
            ),
          ),
        ),
      ),
    );
  }
}
